tobozo/ESP32-BLECollector/Display.h
#include <ESP32-Chimera-Core-Config.h>

#if defined ARDUINO_M5Stack_Core_ESP32 \
 || defined ARDUINO_M5STACK_Core2 \
 || defined ARDUINO_M5STACK_FIRE \
 || defined ARDUINO_ODROID_ESP32 \
 || defined ARDUINO_ESP32_DEV \
 || defined ARDUINO_DDUINO32_XS \
 || defined ARDUINO_ESP32_WROVER_KIT \
 || defined ARDUINO_T \
 || defined ARDUINO_T_Watch \
 || defined ARDUINO_TWATCH_BASE \
 || defined ARDUINO_TWATCH_2020_V1 \
 || defined ARDUINO_TWATCH_2020_V2 \
 || defined ARDUINO_LOLIN_D32_PRO \
  // yay! platform is supported
#else
  #error "NO SUPPORTED BOARD DETECTED !!"
  #error "Please select the right board from the Arduino boards menu"
  #error "Supported boards are: ARDUINO_M5Stack_Core_ESP32, ARDUINO_M5STACK_FIRE, ARDUINO_ODROID_ESP32 or ARDUINO_ESP32_DEV"
#endif

#define BLE_FS M5STACK_SD // inherited from ESP32-Chimera-Core
#define USE_SD_UPDATER

#define tft_drawJpg tft.drawJpg
#define tft_color565 tft.color565
#define tft_readPixels tft.readRect
#define scrollpanel_height() tft.height()
#define scrollpanel_width() tft.width()
#define tft_initOrientation() tft.setRotation(1)
#define tft_drawBitmap tft.drawBitmap
#define SD_begin M5.sd_begin() //M5StackSDBegin // BLE_FS.begin
#define hasHID() (bool)true // inherited M5.Button support
#define hasXPaxShield() (bool) false // custom buttons support (e.g. I2C keyboard)
#define hasTouch() (bool) false // inherited LGFX::Touch support
#define snapNeedsScrollReset() (bool)false // some TFT models need a scroll reset before screen capture
#define BLE_FS_TYPE "sd" // sd = fs::SD, sdcard = fs::SD_MMC
#define SKIP_INTRO // don't play intro (tft spi access messes up SD/DB init)
static const int AMIGABALL_YPOS = 50;
#define BASE_BRIGHTNESS 32 // multiple of 8 otherwise can't turn off ^^
#define SCROLL_OFFSET 0 // tardis definition (some ST7789 needs 320x vertical scrolling adressing but can be limited to 240x240)

// uncomment this block to use SPIFFS instead of SD
// WARNING: can only work with big SPIFFS partition (minumum 2MB, ESP32-WROVER chips only)
//#undef BLE_FS
//#undef BLE_FS_TYPE
//#define BLE_FS SPIFFS // inherited from ESP32-Chimera-Core
//#define BLE_FS_TYPE "spiffs" // sd = fs::SD, sdcard = fs::SD_MMC

// Experimental, requires an ESP32-Wrover/Odroid-Go/M5Fire, a huge partition scheme and no OTA
//#define WITH_WIFI


// display profiles switcher
#if defined( ARDUINO_M5Stack_Core_ESP32 ) || defined( ARDUINO_M5STACK_FIRE ) || defined( ARDUINO_ODROID_ESP32 ) || defined( ARDUINO_M5STACK_Core2 ) || defined( ARDUINO_LOLIN_D32_PRO )

  // custom M5Stack/Odroid-Go go TFT/SD/RTC/GPS settings here (see ARDUINO_ESP32_DEV profile for available settings)
  #if defined( ARDUINO_LOLIN_D32_PRO )

    #undef WITH_WIFI // NTP is useless without a RTC module
    #undef TIME_UPDATE_SOURCE // disable time update accordingly
    #define TIME_UPDATE_SOURCE TIME_UPDATE_NONE
    #undef tft_initOrientation // ILI9341 for D32 Pro only has hardware scroll in portrait mode
    #define tft_initOrientation() tft.setRotation(0)

    #undef hasHID
    #undef hasXPaxShield
    #undef hasTouch
    #define hasHID() (bool)false
    #define hasXPaxShield() (bool) false
    #define hasTouch() (bool) true // inherited LGFX::Touch support

  #elif defined( ARDUINO_ODROID_ESP32 ) // M5Core2

    #undef WITH_WIFI // NTP is useless without a RTC module
    #undef TIME_UPDATE_SOURCE // disable time update accordingly
    #define TIME_UPDATE_SOURCE TIME_UPDATE_NONE
    #undef tft_initOrientation // odroid go only has hardware scroll in portrait mode
    #define tft_initOrientation() tft.setRotation(0)
    #undef USE_SD_UPDATER // Odroid-Go prefers CrashOverride's Application Loader

  #elif defined( ARDUINO_M5STACK_Core2 ) // M5Core2
    #undef HAS_EXTERNAL_RTC
    #define HAS_EXTERNAL_RTC true
    #undef RTC_SDA
    #undef RTC_SCL
    #define RTC_SDA 21 // pin number
    #define RTC_SCL 22 // pin number

    // #undef HAS_GPS
    // #define HAS_GPS true
    // #undef GPS_RX
    // #define GPS_RX 33 // io pin number
    // #undef GPS_TX
    // #define GPS_TX 32 // io pin number

    //#define WITH_WIFI // enable WiFi features since M5Core2 has plenty of ram

    // #undef hasHID
    // #define hasHID() (bool)false // disable buttons/touch

    // adjust per-device core affinity settings here
    //#undef SERIALTASK_CORE
    //#define SERIALTASK_CORE 1
    //#undef HEAPGRAPH_CORE
    //#define HEAPGRAPH_CORE 0

  #else
    // M5Stack Classic, Fire
    #undef HAS_EXTERNAL_RTC
    #define HAS_EXTERNAL_RTC false
    #define RTC_SDA 26 // pin number
    #define RTC_SCL 27 // pin number
  #endif

#elif defined( ARDUINO_DDUINO32_XS )

  #undef hasHID
  #undef SD_begin
  #undef scrollpanel_height
  #undef scrollpanel_width
  #undef tft_initOrientation
  #undef BLE_FS_TYPE
  #undef SCROLL_OFFSET

  #define hasHID() (bool)false // disable buttons
  #define SD_begin /*(bool)true*/BLE_FS.begin() // SD_MMC is auto started
  #define tft_initOrientation() tft.setRotation(0) // default orientation for hardware scroll
  #define scrollpanel_height() tft.width() // invert these if scroll fails
  #define scrollpanel_width() tft.height() // invert these if scroll fails
  #define BLE_FS_TYPE "sdcard" // sd = fs::SD, sdcard = fs::SD_MMC
  #warning D-Duino32-XS detected !!
  // ST7789 uses 320x hardware vscroll def, but this model is 240x240 !!
  // https://www.rhydolabz.com/documents/33/ST7789.pdf
  // restriction: The condition is TFA+VSA+BFA = 320, otherwise Scrolling mode is undefined.
  #define SCROLL_OFFSET 320-240

#elif defined ( ARDUINO_ESP32_WROVER_KIT )

  #define LGFX_ESP_WROVER_KIT

  // since C macros are lazy, overwrite the settings.h values
  #undef HAS_EXTERNAL_RTC
  #undef HAS_GPS
  #undef hasHID
  #undef hasXPaxShield
  #undef snapNeedsScrollReset
  #undef SD_begin
  #undef scrollpanel_height
  #undef scrollpanel_width
  #undef tft_initOrientation
  #undef RTC_SDA
  #undef RTC_SCL
  #undef GPS_RX
  #undef GPS_TX
  #undef BLE_FS_TYPE
  #undef BASE_BRIGHTNESS
  #define BASE_BRIGHTNESS 128

  #define HAS_EXTERNAL_RTC true // will use RTC_SDA and RTC_SCL from settings.h
  #define HAS_GPS true // will use GPS_RX and GPS_TX from settings.h
  #define hasHID() (bool)false // disable buttons
  #define hasXPaxShield() (bool) true
  #define snapNeedsScrollReset() (bool)true
  #define SD_begin /*(bool)true*/BLE_FS.begin() // SD_MMC is auto started
  #define tft_initOrientation() tft.setRotation(2) // default orientation for hardware scroll
  #define scrollpanel_height() tft.height() // invert these if scroll fails
  #define scrollpanel_width() tft.width() // invert these if scroll fails
  #define RTC_SDA 26 // pin number
  #define RTC_SCL 27 // pin number
  #define GPS_RX 39 // io pin number
  #define GPS_TX 35 // io pin number
  #define BLE_FS_TYPE "sdcard" // "sd" = fs::SD, "sdcard" = fs::SD_MMC

