tobozo/ESP32-BLECollector/Display.h
  #warning WROVER KIT DETECTED !!


#elif defined ARDUINO_TWATCH_BASE || defined ARDUINO_TWATCH_2020_V1 || defined ARDUINO_TWATCH_2020_V2 // TTGO T-Watch

  // => Hardware select
  // #define LILYGO_WATCH_2019_WITH_TOUCH        // To use T-Watch2019 with touchscreen, please uncomment this line
  // #define LILYGO_WATCH_2019_NO_TOUCH       // To use T-Watch2019 Not touchscreen , please uncomment this line
  // #define LILYGO_WATCH_BLOCK               // To use T-Watch Block , please uncomment this line
  // #define LILYGO_WATCH_2020_V1              // To use T-Watch2020 , please uncomment this line

/*
  // TODO: implement pcf8563.h from https://github.com/Xinyuan-LilyGO/TTGO-T-Watch
  #undef HAS_EXTERNAL_RTC
  #define HAS_EXTERNAL_RTC true // will use RTC_SDA and RTC_SCL from settings.h

  #define RTC_SDA 21
  #define RTC_SC  22
*/

  #ifdef ARDUINO_TWATCH_BASE
    #undef hasHID
    #define hasHID() (bool)false // disable buttons
  #elif defined LILYGO_WATCH_2019_WITH_TOUCH || defined LILYGO_WATCH_2019_NO_TOUCH
    #undef BLE_FS_TYPE
    #define BLE_FS_TYPE "sdcard" // "sd" = fs::SD, "sdcard" = fs::SD_MMC
    #warning "Scroll is fucked up with LILYGO_WATCH_2019 displays :-("
  #else // TWatch 2020-v1 (default), defined ARDUINO_TWATCH_2020_V1 || defined ARDUINO_TWATCH_2020_V2 // TTGO T-Watch
    #undef BLE_FS
    #undef BLE_FS_TYPE
    #undef SD_begin
    #undef USE_SD_UPDATER

/*
    #include <LITTLEFS.h>
    //#define SPIFFS LITTLEFS
    #define BLE_FS LITTLEFS // inherited from ESP32-Chimera-Core
    #define BLE_FS_TYPE "spiffs" // sd = fs::SD, sdcard = fs::SD_MMC, spiffs = fs::SPIFFS, littlefs = fs::LITTLEFS
    #define SD_begin BLE_FS.begin(true, "/" BLE_FS_TYPE)
*/


    #include <SPIFFS.h>
    #define BLE_FS SPIFFS // inherited from ESP32-Chimera-Core
    #define BLE_FS_TYPE "spiffs" // sd = fs::SD, sdcard = fs::SD_MMC, spiffs = fs::SPIFFS
    #define SD_begin BLE_FS.begin()

    #undef hasHID
    //#undef hasXPaxShield
    #undef hasTouch
    #define hasHID() (bool)false
    //#define hasXPaxShield() (bool) false
    #define hasTouch() (bool) true // inherited LGFX::Touch support
    //#define INVERT_TOUCH_COORDS

  #endif

  #undef tft_initOrientation
  #define tft_initOrientation() tft.setRotation(0) // default orientation for hardware scroll

  #undef BASE_BRIGHTNESS
  #define BASE_BRIGHTNESS 16

  #undef SCROLL_OFFSET
  #define SCROLL_OFFSET 320-240 // these 240x240 displays have graphic memory mapped as 320x240


#else

  #error "NO SUPPORTED BOARD DETECTED !!"
  #error "Either define one of the supported boards, add it to the profile selection, or uncomment this error to experiment"

#endif

#include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core

#if !defined ECC_VERSION_MAJOR || !defined ECC_VERSION_MAJOR || !defined ECC_VERSION_MAJOR
  #error "This app only uses ESP32-Chimera-Core >= 1.2.3"
#else
  #if ((ECC_VERSION_MAJOR << 16) | (ECC_VERSION_MINOR << 8) | (ECC_VERSION_PATCH)) >= ((1 << 16) | (2 << 8) | (3))
    // yay, minimal version requirements are met !
  #else
    #error "This app needs ESP32-Chimera-Core >= 1.2.3"
  #endif
#endif


#if defined USE_SD_UPDATER
  #define SDU_APP_NAME PLATFORM_NAME " BLE Collector" // title for SD-Updater UI
  #include <M5StackUpdater.h> // https://github.com/tobozo/M5Stack-SD-Updater
#endif

#define tft M5.Lcd // syntax sugar
#include "HID_XPad.h" // external HID


static TFT_eSprite gradientSprite( &tft );  // gradient background
static TFT_eSprite heapGraphSprite( &tft ); // activity graph
static TFT_eSprite hallOfMacSprite( &tft ); // mac address badge holder
static TFT_eSprite cursorSprite( &tft );
static TFT_eSprite magnifierSprite( &tft );
static TFT_eSprite alphaSprite( &magnifierSprite );

static bool isQuerying = false; // state maintained while SD is accessed, useful when SD is used instead of SD_MMC
// TODO: make this SD-driver dependant rather than platform dependant
static bool isInQuery()
{
  return isQuerying; // M5Stack uses SPI SD, isolate SD accesses from TFT rendering
}




static int32_t lastCursorX = -1, lastCursorY = -1;

float magnificationLevel = 1.0;
float zoomFactor         = 2.5;

// zone to captured in the backup
const uint32_t captureWidth  = 72;
const uint32_t captureHeight = 144;

const int32_t cursorMargin = 1;

const uint32_t magnifierWidth  = captureWidth  * magnificationLevel;
const uint32_t magnifierHeight = captureHeight * magnificationLevel;

const uint32_t dpi = 48; // approximate pixels for finger size

// center offset
const int32_t magnifierOffsetX = magnifierWidth/2;
const int32_t magnifierOffsetY = magnifierHeight/2 + dpi;

const int32_t captureOffsetX = 0;
const int32_t captureOffsetY = magnifierHeight+dpi; // over the finger

float cursorAvgX = 0; // for easing
float cursorAvgY = 0; // for easing


void initCursor()
{
  cursorSprite.setPsram( false );
  cursorSprite.setColorDepth( 16 );
  cursorSprite.createSprite( magnifierWidth, magnifierHeight );

}


void clearCursor()
{
  if( lastCursorX != -1 && lastCursorY != -1 ) {
    cursorSprite.pushSprite( lastCursorX-magnifierOffsetX, lastCursorY-magnifierOffsetY );
  }
}


void resetCursor()
{
  clearCursor();
  lastCursorX = -1;
  lastCursorY = -1;
  cursorSprite.deleteSprite();
  alphaSprite.deleteSprite();
}


void drawCursor( int32_t x, int32_t y )
{

  // stick touch coords to borders minus margin
  if( x-cursorMargin <= magnifierOffsetX ) { x = magnifierOffsetX+cursorMargin; }
  if( y-cursorMargin <= magnifierOffsetY ) { y = magnifierOffsetY+cursorMargin; }
  if( tft.width()-x  <= magnifierOffsetX+cursorMargin ) { x = tft.width()  - (magnifierOffsetX+cursorMargin); }
  if( tft.height()-y <= cursorMargin )                  { y = tft.height() - (cursorMargin); }

  // ease x/y values
  float weight = 0.5; // ranges from 0 to 1, adjust this
  if( lastCursorX != -1 && lastCursorY != -1 ) {
    cursorAvgX = (weight * cursorAvgX) + ((1-weight) * x);
    cursorAvgY = (weight * cursorAvgY) + ((1-weight) * y);
    x = cursorAvgX;
    y = cursorAvgY;
  } else {
    cursorAvgX = x;
    cursorAvgY = y;
  }

  // magnifier x/y position
  int32_t mgPosX = x-magnifierOffsetX;
  int32_t mgPosY = y-magnifierOffsetY;
  // capture zone x/y position in the magnifier
  //int32_t cpPosX = magnifierWidth-captureWidth/2;
  //int32_t cpPosY = magnifierHeight-captureHeight/2;

  if( x != lastCursorX || y != lastCursorY ) {

