tobozo/ESP32-BLECollector/Display.h
    if( lastCursorX == -1 || lastCursorY == -1 ) {
      initCursor();
      // backup the whole zone under the magnifier
      tft.readRect( mgPosX, mgPosY, magnifierWidth, magnifierHeight, (uint16_t*)cursorSprite.frameBuffer(0) );
      //log_w("First visit");
    } else {
      // backup the differential zone around the magnifier
      int32_t xoffset, yoffset, xsrc, ysrc, xdst, ydst, w, h;
      xoffset = x - lastCursorX;
      yoffset = y - lastCursorY;
      w = abs(xoffset);
      h = abs(yoffset);

      if( xoffset>0 ) { // going right
        xsrc = magnifierWidth-w;
        xdst = 0;
      } else {          // going left
        xsrc = 0;
        xdst = magnifierWidth-w;
      }

      if( yoffset>0 ) { // going down
        ysrc = magnifierHeight-h;
        ydst = 0;
      } else {          // going up
        ysrc = 0;
        ydst = magnifierHeight-h;
      }

      if( w > magnifierWidth || h > magnifierHeight ) {
        // out of previous zone, no need to split draws
        clearCursor();
        tft.readRect( mgPosX, mgPosY, magnifierWidth, magnifierHeight, (uint16_t*)cursorSprite.frameBuffer(0) );

      } else {
        // transfer differential zones

        if( w > 0 ) {
          uint16_t* block = (uint16_t*)calloc( w*magnifierHeight, sizeof(uint16_t*));
          cursorSprite.readRect( xdst, 0, w, magnifierHeight, block ); // get the reappearing zone from the "backup" sprite
          tft.pushImage( (lastCursorX+xdst)-magnifierOffsetX, lastCursorY-magnifierOffsetY, w, magnifierHeight,  block ); // write it back to their original coords on the TFT
          tft.readRect( (x+xsrc)-magnifierOffsetX, lastCursorY-magnifierOffsetY, w, magnifierHeight, block ); // capture next draw zone before it's covered by the magnifier sprite
          cursorSprite.scroll( -xoffset, 0 ); // apply the offset
          cursorSprite.pushImage( xsrc, 0, w, magnifierHeight, block ); // push it back into the "backup" sprite
          free( block );
          lastCursorX = x; // translate position for next differential
          log_d("x/y[%3d:%-3d], last x/y[%3d:%-3d], offsetX[%3d], w[%3d], srcX[%3d], dstX[%3d] Going %s", x, y, lastCursorX, lastCursorY, xoffset, w, xsrc, xdst, xoffset>0 ? "RIGH" : "LEFT" );
        }

        if( h > 0 ) {
          uint16_t* block = (uint16_t*)calloc( magnifierWidth*h, sizeof(uint16_t*));
          cursorSprite.readRect( 0, ydst, magnifierWidth, h, block ); // get the reappearing zone from the "backup" sprite
          tft.pushImage( lastCursorX-magnifierOffsetX, (lastCursorY+ydst)-magnifierOffsetY,  magnifierWidth, h, block ); // write it back to their original coords on the TFT
          tft.readRect( lastCursorX-magnifierOffsetX, (y+ysrc)-magnifierOffsetY, magnifierWidth, h, block ); // capture next draw zone before it's covered by the magnifier sprite
          cursorSprite.scroll( 0, -yoffset ); // apply the offset
          cursorSprite.pushImage( 0, ysrc, magnifierWidth, h, block ); // push it back into the "backup" sprite
          free( block );
          log_d("x/y[%3d:%-3d], last x/y[%3d:%-3d], offsetY[%3d], h[%3d], srcY[%3d], dstY[%3d] Going %s", x, y, lastCursorX, lastCursorY, yoffset, h, ysrc, ydst, yoffset>0 ? "BOTTOM" : "TOP" );
        }

      } // end redraw differential zones

    } // end redraw sprite memoizer

    // pick a zone in the backup sprite and magnify it
    magnifierSprite.setPsram( false );
    magnifierSprite.setColorDepth( 16 );
    magnifierSprite.createSprite( magnifierWidth, magnifierHeight );

    // magnified view
    magnifierSprite.pushImageRotateZoom(
      0, 0,                                  // destination x/y (magnified zone)
      captureWidth/4, 0,                        // source x/y (captured zone)
      0, magnificationLevel*zoomFactor, magnificationLevel*zoomFactor, // angle, magnification x/y
      magnifierWidth, magnifierHeight/4,     // dest width/height
      (uint16_t*)cursorSprite.frameBuffer(0) // buffer
    );

    alphaSprite.setPsram( false );
    alphaSprite.setColorDepth( 16 );
    alphaSprite.createSprite( magnifierWidth, magnifierHeight );
    alphaSprite.pushImage(0, 0, magnifierWidth, magnifierHeight, (uint16_t*)cursorSprite.frameBuffer(0) );
    alphaSprite.fillCircle( magnifierWidth/2, magnifierHeight/4, magnifierHeight/4, TFT_BLACK );
    alphaSprite.pushSprite( 0, 0, TFT_BLACK );
    alphaSprite.deleteSprite();

    //magnifierSprite.drawRect( 0, 0, magnifierSprite.width()-1, magnifierSprite.height()-1, TFT_GREEN ); // outline the magnified zone
    magnifierSprite.drawCircle( magnifierWidth/2, magnifierHeight/4, (magnifierHeight/4)-1, TFT_GREEN ); // looking glass
    magnifierSprite.drawFastVLine( magnifierWidth/2, magnifierHeight/2, magnifierHeight/4, TFT_GREEN ); // handle
    // memoize last coords
    lastCursorX = x;
    lastCursorY = y;
    // draw magnified zone
    magnifierSprite.pushSprite( mgPosX, mgPosY, TFT_WHITE );
    magnifierSprite.deleteSprite();

  }

}


static std::int32_t x, y, lastx = -1, lasty = -1, number = 0;
auto lasttouch = millis();

void checkCursor()
{
  takeMuxSemaphore();
  tft.startWrite();
  tft.writecommand(0x11); // Wake display
  //delay(120); // Delay for pwer supplies to stabilise

  if(tft.getTouch(&x, &y, number))  // collect all touch points
  {

    #if defined INVERT_TOUCH_COORDS
      x = tft.width() - (x+1);
      y = tft.height() - (y+1);
    #endif

    if( x>0 && y>0 && (lastx != x || lasty != y) ) {
      drawCursor( x, y );
      /*
      UI.brightness = map( y, 0, tft.height(), 255, 0 );
      tft_setBrightness( UI.brightness );
      */
      tft.display();
      lastx = x;
      lasty = y;
      lasttouch = millis();
    }

  } else {
    if( lasttouch + 500 < millis() ) {
      resetCursor();
    }
  }


  tft.endWrite();
  giveMuxSemaphore();
}


// TFT_eSPI / LGFX / Chimera-Core API

void tft_begin()
{

  M5.begin( true, true, false, false, false ); // don't start Serial

  #if HAS_EXTERNAL_RTC
    Wire.begin(RTC_SDA, RTC_SCL);
    M5.I2C.scan();
    M5.update();
  #endif
  delay( 100 );
  #ifdef __M5STACKUPDATER_H
    if( hasHID() ) {
      // build has buttons => enable SD Updater at boot
      // New SD Updater support, requires the latest version of https://github.com/tobozo/M5Stack-SD-Updater/
      #if defined M5_SD_UPDATER_VERSION_INT
        SDUCfg.setLabelMenu("<< Menu");
        SDUCfg.setLabelSkip("Launch");
        checkSDUpdater( BLE_FS, MENU_BIN, 5000, TFCARD_CS_PIN ); // Filesystem, Launcher bin path, Wait delay, Sdcard CS pin
      #else
        checkSDUpdater();
      #endif
    } else if( hasXPaxShield() ) {
      XPadShield.init();
      XPadShield.update();
      if( XPadShield.BtnA->wasPressed() ) {
        Serial.println("Will Load menu binary");
        #if defined M5_SD_UPDATER_VERSION_INT
          updateFromFS( BLE_FS, MENU_BIN );
        #else
          updateFromFS();
        #endif
        ESP.restart();
      }
    } else if( hasTouch() ) {

      std::uint16_t xmin = 0;
      std::uint16_t xmax = tft.width()-1;
      std::uint16_t ymin = 0;
      std::uint16_t ymax = tft.height()-1;

      std::uint16_t parameters[8] =
        {
          xmin, ymin // left top
        , xmin, ymax // left bottom
        , xmax, ymin // right top
        , xmax, ymax // right bottom

