tobozo/ESP32-BLECollector/Display.h
        };

      tft.setTouchCalibrate(parameters);

      if (tft.touch()) {
        // yay touch support detected !
        log_w("LGFX Touch support detected");

        /*
        std::int32_t x, y, number = 0;
        while (tft.getTouch(&x, &y, number))  // collect all touch points
        {
          log_w("Touch #%d detected at [%d:%d]", number, x, y );
          tft.fillCircle(x, y, 5, (std::uint32_t)(number * 0x333333u));
          tft.display();

          ++number;
        }
        */
      }
    }
  #endif
}

void tft_setBrightness( uint8_t brightness )
{
  tft.setBrightness( brightness );
}

void tft_getTextBounds(const char *string, int16_t x, int16_t y, int16_t *x1, int16_t *y1, uint16_t *w, uint16_t *h)
{
  *w = tft.textWidth( string );
  *h = tft.fontHeight();
}

void tft_getTextBounds(const String &str, int16_t x, int16_t y, int16_t *x1, int16_t *y1, uint16_t *w, uint16_t *h)
{
  *w = tft.textWidth( str.c_str() );
  *h = tft.fontHeight();
}

void tft_fillCircle( uint16_t x, uint16_t y, uint16_t r, uint16_t color)
{
  tft.fillCircle(x, y, r, color);
}

void tft_drawCircle( uint16_t x, uint16_t y, uint16_t r, uint16_t color)
{
  tft.drawCircle(x, y, r, color);
}

void tft_fillRect( uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
  tft.fillRect(x, y, w, h, color);
}

void tft_fillTriangle( uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
  tft.fillTriangle(x0, y0, x1, y1, x2, y2, color);
}


// software scroll (very slow, but necessary for screenshots)
static int32_t s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp;
static uint16_t circularScrollBufferHSize = 240;
static uint16_t circularScrollBufferVSize = 16;
static uint16_t circularScrollBufferSize = circularScrollBufferHSize*circularScrollBufferVSize;
void tft_scrollTo(int32_t vsp)
{
  if( vsp == 0 ) return;
  //tft.getScrollRect( &s_x_tmp, &s_y_tmp, &s_w_tmp, &s_h_tmp );
  int32_t direction   = vsp>0 ? 1 : -1;
  int32_t blockHeight = abs(vsp);
  int32_t blockSize   = s_w_tmp*blockHeight;
  int32_t bottomY     = (s_y_tmp+s_h_tmp)-blockHeight;

  if( blockSize <= circularScrollBufferSize ) {
    // scroll area fits into buffer
    RGBColor * scrollArea = new RGBColor[s_w_tmp*blockHeight];
    int32_t ySrc        = 0;
    int32_t yDest       = 0;
    if( vsp < 0 ) {
      ySrc  = s_y_tmp;
      yDest = bottomY;
    } else {
      ySrc  = bottomY;
      yDest = s_y_tmp;
    }
    tft.readRectRGB( s_x_tmp, ySrc,  s_w_tmp, blockHeight, scrollArea );
    tft.scroll(0, vsp);
    tft.pushImage(   s_x_tmp, yDest, s_w_tmp, blockHeight, scrollArea );
    log_v("[block] tft.scroll(0, %d); scrollRect( %d, %d, %d, %d ) ", vsp, s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp );
    free( scrollArea );
  } else {
    // scroll area doesn't fit into buffer, need to split
    log_v("[split] tft.scroll(0, %d); scrollRect( %d, %d, %d, %d ) ", vsp, s_x_tmp, s_y_tmp, s_w_tmp, s_h_tmp );
    // how many scan lines can the buffer fit ?
    int scanLines = floor( circularScrollBufferSize / s_w_tmp );
    // how many iterations these scanLines will be required to cover the current scroll zone
    int iterations = floor( blockHeight / scanLines );
    // are there any leftover lines
    int leftover = blockHeight%scanLines;
    // go recursive
    while( iterations-- > 0 ) {
      tft_scrollTo( scanLines * direction );
    }
    // do leftover lines if any
    tft_scrollTo( leftover * direction );
  }
}


// hardware scroll
void tft_setupHScrollArea(uint16_t tfa, uint16_t vsa, uint16_t bfa)
{
  bfa += SCROLL_OFFSET; // compensate for stubborn firmware
  tft.startWrite();
  tft.writecommand(0x33);  // VSCRDEF Vertical scroll definition
  tft.writedata(tfa >> 8); // Top Fixed Area line count
  tft.writedata(tfa);
  tft.writedata(vsa >> 8); // Vertical Scrolling Area line count
  tft.writedata(vsa);
  tft.writedata(bfa >> 8); // Bottom Fixed Area line count
  tft.writedata(bfa);
  tft.endWrite();

  log_d("Init Hardware Scroll area with tfa/vsa/bfa %d/%d/%d on w/h %d/%d", tfa, vsa, bfa, scrollpanel_width(), scrollpanel_height());
}


// hardware scroll
void tft_hScrollTo(uint16_t vsp)
{
  tft.startWrite();
  tft.writecommand(0x37); // ILI9341_VSCRSADD Vertical scrolling pointer
  tft.writedata(vsp>>8);
  tft.writedata(vsp);
  tft.endWrite();
}


void tft_fillGradientHRect( uint16_t x, uint16_t y, uint16_t width, uint16_t height, RGBColor colorstart, RGBColor colorend )
{
  log_v("tft_fillGradientHRect( %d, %d, %d, %d )", x, y, width, height );
  gradientSprite.setPsram( false ); // don't bother using psram for that
  //gradientSprite.setSwapBytes( false );
  gradientSprite.setColorDepth( 16 );
  gradientSprite.createSprite( width, 1);
  tft.startWrite();
  gradientSprite.drawGradientHLine( 0, 0, width, colorstart, colorend );
  for( uint16_t h = 0; h < height; h++ ) {
    gradientSprite.pushSprite( x, y+h );
  }
  tft.endWrite();
  gradientSprite.deleteSprite();
}

void tft_fillGradientVRect( uint16_t x, uint16_t y, uint16_t width, uint16_t height, RGBColor colorstart, RGBColor colorend )
{
  gradientSprite.setPsram( false ); // don't bother using psram for that
  //gradientSprite.setSwapBytes( false );
  gradientSprite.setColorDepth( 16 );
  gradientSprite.createSprite( 1, height);
  tft.startWrite();
  gradientSprite.drawGradientVLine( 0, 0, height, colorstart, colorend );
  for( uint16_t w = 0; w < width; w++ ) {
    gradientSprite.pushSprite( x+w, y );
  }
  tft.endWrite();
  gradientSprite.deleteSprite();
}

void tft_drawGradientHLine( uint32_t x, uint32_t y, uint32_t w, RGBColor colorstart, RGBColor colorend )
{
  tft_fillGradientHRect( x, y, w, 1, colorstart, colorend );
}

void tft_drawGradientVLine( uint32_t x, uint32_t y, uint32_t h, RGBColor colorstart, RGBColor colorend )
{
  tft_fillGradientVRect( x, y, 1, h, colorstart, colorend );
}

enum TextDirections
{
  ALIGN_FREE   = 0,
  ALIGN_LEFT   = 1,
  ALIGN_RIGHT  = 2,
  ALIGN_CENTER = 3,
};

enum BLECardThemes
{
  IN_CACHE_ANON         = 0,
  IN_CACHE_NOT_ANON     = 1,
  NOT_IN_CACHE_ANON     = 2,
  NOT_IN_CACHE_NOT_ANON = 3
};

